#include <iostream>
#include <deque>

void print(std::deque<long long int> deq) {
	for (int i = 0; i < deq.size(); i++) {
		std::cout << deq[i] << " ";
	}
	std::cout << "\nSize: " << deq.size();
}

int main() {
	std::deque<long long int> deq = { -13, 0, 10, -4, 6, 11, 12, 28, 50, 89, 166, 304 };

	for (int i = 9; i < 45; i++) {
		deq.push_back(deq[i + 2] + deq[i + 1] + deq[i] - 1);
	}

	while (deq.size() != 96) {
		deq.push_front(deq[2] - deq[1] - deq[0] + 1);
	}

	print(deq);
	return 0;
}

/*
Є послідовність елементів -13, 0, 10, -4, 6, 11, 12, 28, 50, 89, 166, 304. Кожен
наступний елемент може бути обчислений за формулою:
елемент[і+3]=елемент[і+2]+елемент[і+1]+елемент[і]-1
кожен попередній елемент:
елемент[і-1]=елемент[і+2]-елемент[і+1]-елемент[і]+1
Використовуючи двосторонню чергу, розширте цю послідовність вліво і вправо так,
щоб в ній стало 96 елементів.
*/
